# Transparency Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
AnalysisDisplayDiagramSettings..::..Transparency Property
AnalysisDisplayDiagramSettings Class See Also
---
Transparency percentage of diagram color fill
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public int Transparency { get; set; }
```

Visual Basic
---
```text
Public Property Transparency As Integer
	Get
	Set
```

Visual C++
---
```text
public:
property int Transparency {
	int get ();
	void set (int value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentsInconsistentException | When setting this property: transparency is less than 0 or greater than 100 |

# See Also
AnalysisDisplayDiagramSettings Class
Autodesk.Revit.DB.Analysis Namespace